archive/test/testak/testak.wsdl

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions targetNamespace="http://producer.x-road.eu"	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://producer.x-road.eu"	xmlns:xrd="http://x-road.eu/xsd/xroad.xsd" xmlns:id="http://x-road.eu/xsd/identifiers"	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">	<wsdl:types>		<xs:schema targetNamespace="http://producer.x-road.eu"			xmlns:xs="http://www.w3.org/2001/XMLSchema"			xmlns:xmime="http://www.w3.org/2005/05/xmlmime">			<xs:import namespace="http://x-road.eu/xsd/xroad.xsd"				schemaLocation="http://x-road.eu/xsd/xroad.xsd" />			<xs:element name="getPersonData">				<xs:complexType>					<xs:sequence>						<xs:element name="request">							<xs:complexType>								<xs:sequence>									<xs:element name="personCode" type="xs:string">										<xs:annotation>											<xs:appinfo>												<xrd:title>													PersonData input												</xrd:title>											</xs:appinfo>										</xs:annotation>									</xs:element>								</xs:sequence>							</xs:complexType>						</xs:element>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="getPersonDataResponse">				<xs:complexType>					<xs:sequence>						<xs:element name="response">							<xs:complexType>								<xs:sequence>									<xs:element name="personCode"										type="xs:string">										<xs:annotation>											<xs:appinfo>												<xrd:title>													PersonData response												</xrd:title>											</xs:appinfo>										</xs:annotation>									</xs:element>									<xs:element name="firstName"										type="xs:string">									</xs:element>									<xs:element name="lastName"										type="xs:string">									</xs:element>									<xs:element name="attachment">										<xs:complexType>											<xs:simpleContent>												<xs:extension base="xs:base64Binary">													<xs:attribute name="href" type="xs:string"/>												</xs:extension>											</xs:simpleContent>										</xs:complexType>									</xs:element>								</xs:sequence>							</xs:complexType>						</xs:element>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="getPersonDataMtom">				<xs:complexType>					<xs:sequence>						<xs:element name="request">							<xs:complexType>								<xs:sequence>									<xs:element name="personCode" type="xs:string">										<xs:annotation>											<xs:appinfo>												<xrd:title>													PersonData input												</xrd:title>											</xs:appinfo>										</xs:annotation>									</xs:element>								</xs:sequence>							</xs:complexType>						</xs:element>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="getPersonDataMtomResponse">				<xs:complexType>					<xs:sequence>						<xs:element name="response">							<xs:complexType>								<xs:sequence>									<xs:element name="personCode"										type="xs:string">										<xs:annotation>											<xs:appinfo>												<xrd:title>													PersonData response												</xrd:title>											</xs:appinfo>										</xs:annotation>									</xs:element>									<xs:element name="firstName"										type="xs:string">									</xs:element>									<xs:element name="lastName"										type="xs:string">									</xs:element>									<xs:element name="attachment" type="xs:base64Binary" xmime:expectedContentTypes="application/octet-stream"/>								</xs:sequence>							</xs:complexType>						</xs:element>					</xs:sequence>				</xs:complexType>			</xs:element>		</xs:schema>	</wsdl:types>
	<wsdl:message name="getPersonDataResponse">		<wsdl:part name="getPersonDataResponse" element="tns:getPersonDataResponse" />	</wsdl:message>	<wsdl:message name="getPersonDataMtomResponse">		<wsdl:part name="getPersonDataMtomResponse" element="tns:getPersonDataMtomResponse" />	</wsdl:message>	<wsdl:message name="getPersonData">		<wsdl:part name="getPersonData" element="tns:getPersonData" />	</wsdl:message>	<wsdl:message name="getPersonDataMtom">		<wsdl:part name="getPersonDataMtom" element="tns:getPersonDataMtom" />	</wsdl:message>	<wsdl:message name="requestheader">		<wsdl:part name="client" element="xrd:client" />		<wsdl:part name="service" element="xrd:service" />		<wsdl:part name="id" element="xrd:id" />		<wsdl:part name="userId" element="xrd:userId" />		<wsdl:part name="protocolVersion" element="xrd:protocolVersion" />	</wsdl:message>	<wsdl:portType name="getPersonDataPort">		<wsdl:operation name="getPersonData">			<wsdl:documentation>				<xrd:title>getPersonData</xrd:title>			</wsdl:documentation>			<wsdl:input name="getPersonData" message="tns:getPersonData" />			<wsdl:output name="getPersonDataResponse" message="tns:getPersonDataResponse" />		</wsdl:operation>		<wsdl:operation name="getPersonDataMtom">			<wsdl:documentation>				<xrd:title>getPersonDataMtom</xrd:title>			</wsdl:documentation>			<wsdl:input name="getPersonDataMtom" message="tns:getPersonDataMtom" />			<wsdl:output name="getPersonDataMtomResponse" message="tns:getPersonDataMtomResponse" />		</wsdl:operation>	</wsdl:portType>	<wsdl:binding name="getPersonDataPortSoap11" type="tns:getPersonDataPort">		<soap:binding style="document"			transport="http://schemas.xmlsoap.org/soap/http" />		<wsdl:operation name="getPersonData">			<soap:operation soapAction="" />			<xrd:version>v1</xrd:version>			<wsdl:input name="getPersonData">				<soap:body use="literal" />				<soap:header message="tns:requestheader" part="client"					use="literal" />				<soap:header message="tns:requestheader" part="service"					use="literal" />				<soap:header message="tns:requestheader" part="userId"					use="literal" />				<soap:header message="tns:requestheader" part="id" use="literal" />				<soap:header message="tns:requestheader" part="protocolVersion"					use="literal" />			</wsdl:input>			<wsdl:output name="getPersonDataResponse">				<soap:body use="literal" />				<soap:header message="tns:requestheader" part="client"					use="literal" />				<soap:header message="tns:requestheader" part="service"					use="literal" />				<soap:header message="tns:requestheader" part="userId"					use="literal" />				<soap:header message="tns:requestheader" part="id" use="literal" />				<soap:header message="tns:requestheader" part="protocolVersion"					use="literal" />			</wsdl:output>		</wsdl:operation>		<wsdl:operation name="getPersonDataMtom">			<soap:operation soapAction="" />			<xrd:version>v1</xrd:version>			<wsdl:input name="getPersonDataMtom">				<soap:body use="literal" />				<soap:header message="tns:requestheader" part="client"					use="literal" />				<soap:header message="tns:requestheader" part="service"					use="literal" />				<soap:header message="tns:requestheader" part="userId"					use="literal" />				<soap:header message="tns:requestheader" part="id" use="literal" />				<soap:header message="tns:requestheader" part="protocolVersion"					use="literal" />			</wsdl:input>			<wsdl:output name="getPersonDataMtomResponse">				<soap:body use="literal" />				<soap:header message="tns:requestheader" part="client"					use="literal" />				<soap:header message="tns:requestheader" part="service"					use="literal" />				<soap:header message="tns:requestheader" part="userId"					use="literal" />				<soap:header message="tns:requestheader" part="id" use="literal" />				<soap:header message="tns:requestheader" part="protocolVersion"					use="literal" />			</wsdl:output>		</wsdl:operation>	</wsdl:binding>	<wsdl:service name="producerPortService">		<wsdl:port name="getPersonDataPortSoap11" binding="tns:getPersonDataPortSoap11">
			<soap:address location="http://aj04.ci.kit:8080/testak/soap" />		</wsdl:port>	</wsdl:service></wsdl:definitions>
