archive/filter/src/test/resources/test_request.xml

<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xrd="http://x-road.eu/xsd/xroad.xsd"
	xmlns:id="http://x-road.eu/xsd/identifiers"
	xmlns:pr="http://producer.x-road.eu">
   <SOAP-ENV:Header>
      <xrd:protocolVersion>4.0</xrd:protocolVersion>
      <xrd:id>4894e35d-bf0f-44a6-867a-8e51f1daa7e0</xrd:id>
      <xrd:userId>EE12345678901</xrd:userId>
      <xrd:service id:objectType="SERVICE">
         <id:xRoadInstance>EE</id:xRoadInstance>
         <id:memberClass>GOV</id:memberClass>
         <id:memberCode>MEMBER1</id:memberCode>
         <!--Optional:-->
         <id:subsystemCode>SUBSYSTEM1</id:subsystemCode>
         <id:serviceCode>getPersonData</id:serviceCode>
         <!--Optional:-->
         <id:serviceVersion>v1</id:serviceVersion>
      </xrd:service>
      <xrd:client id:objectType="MEMBER">
         <id:xRoadInstance>EE</id:xRoadInstance>
         <id:memberClass>GOV</id:memberClass>
         <id:memberCode>MEMBER2</id:memberCode>
         <!--Optional:-->
         <id:subsystemCode>SUBSYSTEM2</id:subsystemCode>
      </xrd:client>
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <pr:getPersonData>
         <request>
            <personCode>47101010033</personCode>
         </request>
      </pr:getPersonData>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
